Tekla.Structures.Plugins.DirectManipulation.Services.Tools.MultiVertexManipulator
The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.MultiVertexManipulator class provides a manipulator, that should be used with an instance of type Tekla.Structures.Model.Component
that uses input values of type Tekla.Structures.Geometry3d.Point.
Tekla.Structures.Plugins.DirectManipulation.Core.ManipulatorBase

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.MultiVertexManipulator.polygonManipulator
The polygon manipulator.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.MultiVertexManipulator.#ctor(System.Object,Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext,Tekla.Structures.Plugins.DirectManipulation.Services.Tools.PolygonRequirements)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.MultiVertexManipulator class.
parent: The parent object.
manipulationContext: The manipulation context.
requirements: The requirements.
Remarks:
This manipulator assumes the actual inputs are of type Tekla.Structures.Geometry3d.Point.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.MultiVertexManipulator.CommitChanges
Event to be taken, when the manipulator is commiting changes to the component input.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.MultiVertexManipulator.Points
Gets the points.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.MultiVertexManipulator.Parent
Gets or sets the parent object.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.MultiVertexManipulator.AttachToManipulatorService(Tekla.BIM.DirectManipulation.Services.Manipulators.IManipulatorService)


Tekla.Structures.Plugins.DirectManipulation.Services.Tools.MultiVertexManipulator.Dispose(System.Boolean)


Tekla.Structures.Plugins.DirectManipulation.Services.Tools.MultiVertexManipulator.OnCommit
Event handler for the Tekla.Structures.Features.Common.PolygonManipulation.PolygonManipulatorBase.OnCommit event of Tekla.Structures.Plugins.DirectManipulation.Services.Tools.MultiVertexManipulator.polygonManipulator.